import { formatStudentLogs } from './utils'
import dedent from 'dedent'
import type { Student } from './stores'

export const getHangbalPrompt = (
  student: Student,
  outputExample: string,
  extraInfo: string
) => dedent`
  초등학생 교사로서 날짜별 행동 기록 (누가기록)을 보고 총체적으로 학생을 이해할 수 있는 행동특성 및 발달사항 (행발)을 작성하세요. 다양한 분야의 변화와 성장 등을 종합적, 구체적으로 기재하세요.

  # 지시사항

  - 줄바꿈 없이 한 문단으로 공백 포함 **200-300자 내외**로 작성하세요. 한 문장은 공백 포함 50-100자로 작성하세요.
  - 그, 그녀, 학생 등의 주어 없이 작성하세요.
  - 수식어를 많이 사용하세요.
  - **부정적 내용은 다음을 참고해 반드시 개선 방향 및 가능성과 함께 긍정적으로 완곡하게 작성하세요.**
      - 고집이 셈 → 타인의 말에 흔들리지 않고 자신의 소신을 끝까지 밀고 나가는 결단력이 뛰어남.
      - 친구랑 자주 싸움 → 자신만의 논리를 펼치며 친구들과 대화하는 것을 즐기는 등 현대사회에서 필요한 민주시민으로서의 자질을 갖춤.
      - 말이 거침 → 완곡하고 유화적인 언어 사용으로 부드러운 모습을 보인다면 균형 있는 모습으로 성장이 기대됨.
      - 거짓말을 잘함 → 상상력이 풍부하여 이야기 지어내는 것을 좋아하며 이에 심취하는 몰입력이 남다름.
  - 활동함, 표현함, 발표함, 제작함, 씀, 앎 등의 어미를 사용하세요.
  - 과거형이 아닌 현재형을 사용하세요. (예시: 했음 → 함)
  - 아래 예시를 참고하세요.

  # 답변 형식

  다음 형식을 따라 답변하세요.
  
  > 작성된 행발

  ### 다른 표현 제안

  - 사용할 수 있는 다른 표현들 몇 가지 (따옴표 없이)

  # 기록

  ${formatStudentLogs(student.name, student.logs, {
  markdown: true,
  includeName: false
})}
  ${extraInfo ? `\n**추가 정보**: ${extraInfo}\n` : ''}
  # 행발 예시

  ## 예시 1

  > 친구들에게 따뜻하고 배려심 깊은 모습을 보이며, 어려움을 겪는 친구에게 먼저 다가가 도움을 줌. 어린 저학년 동생들을 잘 챙기며 사이좋게 지내는 모습을 보임. 가끔 마음이 여려 친구에게 상처받는 모습을 보이기도 함. 앞에 나서는 것을 좋아하지는 않으나, 발표나 활동에 즐겁게 참여하며 자신의 의견을 차분하게 표현하는 모습을 보임. 차분하고 느긋한 성격으로 여러 친구와 관계가 원만하며, 주어진 일을 잊지 않고 성실히 하는 책임감 있는 모습이 인상적임. 앞으로도 지금처럼 꾸준히 노력한다면 여러 사람에게 신뢰받는 협력적 지도자가 되리라 생각됨.

  ### 다른 표현 제안

  - 또래 친구들과 원만한 관계를 유지하며 배려심 깊은 태도로 학급 분위기 조성에 기여함
  - 타인을 향한 따뜻한 마음씨와 친절한 성품으로 주변 친구들에게 신뢰를 받음
  - 차분하고 성실한 태도로 맡은 일을 책임감 있게 수행하며 꾸준한 성장을 보임
  - 자신의 생각을 조리 있게 표현하고 타인의 의견을 경청하는 균형 잡힌 의사소통 능력을 지님

  ## 예시 2

  > 평소 다양한 독서로 상식이 풍부하며 다양한 분야의 외부 강사 교육에 많은 관심을 보임. 가족에 대한 애정이 많으며 자주 표현하고 이야기하는 모습이 긍정적임. 새로운 사람들과 친밀감을 형성하며 활발히 소통하고 긍정적인 대인관계를 형성하려는 모습을 보임. 수업에 집중할 때와 집중하지 않을 때의 학습 결과 차이가 커 집중력을 키운다면 큰 발전이 기대됨. 글쓰기나 발표할 때 자극적인 소재를 자주 사용하는 경향이 있으나, 이를 창의적이고 긍정적으로 발전시킨다면 개성을 더욱 풍부하게 키울 수 있을 것으로 생각함. 독서를 좋아하기 때문에 앞으로 독서 후 글로 정리하거나 다른 사람들과 토론하는 등 본인에게 맞는 공부법을 찾는다면 많은 발전이 있을 것이라 기대됨.

  ### 다른 표현 제안

  - 다양한 분야의 지식을 습득하고 이를 적극적으로 활용하는 풍부한 사고력을 보여줌
  - 새로운 지식과 경험에 호기심이 많으며 적극적으로 탐구하는 자세가 돋보임
  - 가족 간의 긍정적인 유대관계를 바탕으로 따뜻한 마음씨를 갖춤
  - 원활한 의사소통 능력으로 새로운 환경에서도 빠르게 적응하며 건강한 대인관계를 형성함

  ## 예시 3

  > 신체 기능이 뛰어나고 운동 감각이 있어 다양한 경쟁 활동에서 긍정적인 영향을 줌. 장난이 많은 편이지만 친구들과 다툼을 유발하지 않으며 긍정적인 태도를 보여줌. 유쾌하고 익살스러운 모습으로 사교성이 좋으며, 친화력이 뛰어나 여러 친구에게 인기가 많아 학급 분위기를 즐겁게 만듦. 그림 그리기를 좋아하여 평소에도 그림을 자주 그리며, 미술 시간에 감각적인 미술 작품을 그릴 때도 있음. 하지만 수업 시간에도 그림을 그리거나 장난을 치는 등 산만한 모습을 종종 보임. 수업에 진지하게 임하고 집중한다면 학업 성취에 많은 발전이 있을 것으로 생각함.

  ### 다른 표현 제안

  - 운동 신경이 뛰어나며 체육 활동에서 리더십을 발휘하여 활동에 활기를 더함
  - 유쾌하고 친화력 있는 성격으로 학급의 즐거운 분위기를 조성함
  - 미술에 대한 관심과 재능이 있어 창의적인 작품 활동을 통해 예술적 감각을 드러냄
  - 활발하고 적극적인 성격으로 다양한 활동에 참여하며 주변 친구들과 원만한 관계를 유지함

  ${outputExample ? `## 추가 사용자 예시\n\n다음은 사용자가 직접 입력한 행발 예시입니다. 예시의 문장 흐름 및 형식, 스타일을 참고해 작성하되 표현을 그대로 따라 사용하지 마세요.\n\n${outputExample}` : ''}
`
